PROFILEANDBAL.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://com.ztesoft.zsmart/xsd">
	<soapenv:Header>
		<xsd:AuthHeader>
			<Username>ESERV</Username>
			<Password>WS001</Password>
		</xsd:AuthHeader>
	</soapenv:Header>
	<soapenv:Body>
		<xsd:QueryProfileAndBalRequest>
			<MSISDN>22390662894</MSISDN>
			<TransactionSN>1726146510619652</TransactionSN>
		</xsd:QueryProfileAndBalRequest>
	</soapenv:Body>
</soapenv:Envelope>

<?xml version='1.0' encoding='utf-8'?>
<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Body>
		<ns:QueryProfileAndBalResponse
			xmlns:ns="http://com.ztesoft.zsmart/xsd">
			<MSISDN>22390662894</MSISDN>
			<DefLang>5</DefLang>
			<State>A</State>
			<StateSet>00000000000000</StateSet>
			<ActiveStopDate>2024-11-03</ActiveStopDate>
			<SuspendStopDate>2025-03-03</SuspendStopDate>
			<DisableStopDate>2025-06-01</DisableStopDate>
			<ServiceStopDate>2123-07-01</ServiceStopDate>
			<BrandIndex>SPYIRIWAMOBILE</BrandIndex>
			<ServiceClass>DPPYIRIWA</ServiceClass>
			<TransactionSN>1726146510619652</TransactionSN>
			<BalDtoList>
				<BalDto>
					<BalID>35452109472</BalID>
					<AcctResCode>21</AcctResCode>
					<AcctResName>Forfait_Data</AcctResName>
					<Balance>0</Balance>
					<EffDate>2024-07-01</EffDate>
					<ExpDate>2024-10-02</ExpDate>
					<UpdateDate>2024-09-09 01:09:49</UpdateDate>
				</BalDto>
				<BalDto>
					<BalID>35452234876</BalID>
					<AcctResCode>2</AcctResCode>
					<AcctResName>Bonus SMS</AcctResName>
					<Balance>-80</Balance>
					<EffDate>2024-07-01</EffDate>
					<ExpDate>2024-09-19</ExpDate>
					<UpdateDate>2024-09-04 19:59:37</UpdateDate>
				</BalDto>
				<BalDto>
					<BalID>35553793924</BalID>
					<AcctResCode>13</AcctResCode>
					<AcctResName>Forfait_National</AcctResName>
					<Balance>-26400</Balance>
					<EffDate>2024-08-14</EffDate>
					<ExpDate>2024-09-13</ExpDate>
					<UpdateDate>2024-08-27 00:40:30</UpdateDate>
				</BalDto>
				<BalDto>
					<BalID>35553793928</BalID>
					<AcctResCode>23</AcctResCode>
					<AcctResName>Forfait_Bonus_Data</AcctResName>
					<Balance>0</Balance>
					<EffDate>2024-08-14</EffDate>
					<ExpDate>2024-09-13</ExpDate>
					<UpdateDate>2024-08-29 13:02:52</UpdateDate>
				</BalDto>
				<BalDto>
					<BalID>35454479920</BalID>
					<AcctResCode>811</AcctResCode>
					<AcctResName>compte Bonus Pro</AcctResName>
					<Balance>-650</Balance>
					<EffDate>2024-07-02</EffDate>
					<ExpDate>2024-08-01</ExpDate>
					<UpdateDate>2024-07-02 13:06:08</UpdateDate>
				</BalDto>
				<BalDto>
					<BalID>35553814620</BalID>
					<AcctResCode>17</AcctResCode>
					<AcctResName>Forfait_SMS_Illimite</AcctResName>
					<Balance>-109998</Balance>
					<EffDate>2024-08-14</EffDate>
					<ExpDate>2024-09-13</ExpDate>
					<UpdateDate>2024-08-14 10:35:09</UpdateDate>
				</BalDto>
				<BalDto>
					<BalID>35452060288</BalID>
					<AcctResCode>1</AcctResCode>
					<AcctResName>Principal</AcctResName>
					<Balance>-10598</Balance>
					<EffDate>2024-07-01</EffDate>
					<ExpDate>2024-11-03</ExpDate>
					<UpdateDate>2024-09-12 13:08:30</UpdateDate>
				</BalDto>
			</BalDtoList>
			<PreFlag>1</PreFlag>
			<ProviderID>0</ProviderID>
		</ns:QueryProfileAndBalResponse>
	</soapenv:Body>
</soapenv:Envelope>